In [174]:
import pyspark
from pyspark.sql import SparkSession

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     null| 34|        10| 38000|
|     null| 36|      null|  null|
+---------+---+----------+------+

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

8
<class 'pyspark.sql.dataframe.DataFrame'>

['Name', 'Age', 'Experience', 'Salary']

In [177]:
spark=SparkSession.builder.appName('Precums').getOrCreate()
spark

In [178]:
filepath = r'D:\python\meTryPython\learnspark\first\resources\test2.csv'
df_spark=spark.read.option("nullValue", "null").csv(filepath,header=True,inferSchema=True)
df_spark.show()
df_spark.printSchema()
print(df_spark.count())
print(type(df_spark))
df_spark.columns

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     null| 34|        10| 38000|
|     null| 36|      null|  null|
+---------+---+----------+------+

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

8
<class 'pyspark.sql.dataframe.DataFrame'>

['Name', 'Age', 'Experience', 'Salary']

**inferSchema = True, menentukan schema dari tablenya yang dibaca. penting**

In [173]:
filepath = r'D:\python\meTryPython\learnspark\first\resources\test2.csv'
df_spark=spark.read.option("nullValue", "null").csv(filepath,header=True,inferSchema=True)
df_spark.show()
df_spark.printSchema()
print(df_spark.count())
print(type(df_spark))
df_spark.columns

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     null| 34|        10| 38000|
|     null| 36|      null|  null|
+---------+---+----------+------+

root
 |-- Name: string (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Experience: integer (nullable = true)
 |-- Salary: integer (nullable = true)

8
<class 'pyspark.sql.dataframe.DataFrame'>

['Name', 'Age', 'Experience', 'Salary']

**you can specify how spark will read the null value**

In [162]:
# df_spark = spark.read \
#     .option("header", True) \
#     .option("nullValue", "null") \
#     .csv(filepath)

In [163]:
df_spark

DataFrame[Name: string, Age: int, Experience: int, Salary: int]

In [164]:
df_spark.drop('Name').show()

+---+----------+------+
|Age|Experience|Salary|
+---+----------+------+
| 31|        10| 30000|
| 30|         8| 25000|
| 29|         4| 20000|
| 24|         3| 20000|
| 21|         1| 15000|
| 23|         2| 18000|
| 34|        10| 38000|
| 36|      null|  null|
+---+----------+------+

In [165]:
df_spark.na.drop().show()

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [166]:
df_spark.na.drop(how='all').show()#milih cmn row yg semua kolomnya null
df_spark.na.drop(how='any').show() #milih apakah minimal ada satu null bakal didrop
df_spark.na.drop(how="any",subset=['Name']).show() #milih kolom mana yg disortir

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
|     null| 34|        10| 38000|
|     null| 36|      null|  null|
+---------+---+----------+------+

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

+---------+---+----------+------+
|     Name|Age|Experience|Salary|
+---------+---+----------+------+
|    Krish| 31|        10| 30000|
|Sundhansh| 30|         8| 25000|
|    Sunny| 29|         4| 20000|
|     Paul| 24|         3| 20000|
|   Harsha| 21|         1| 15000|
|  Shubham| 23|         2| 18000|
+---------+---+----------+------+

In [167]:
df_spark.na.fill('Missing nih Bos').show()

+---------------+---+----------+------+
|           Name|Age|Experience|Salary|
+---------------+---+----------+------+
|          Krish| 31|        10| 30000|
|      Sundhansh| 30|         8| 25000|
|          Sunny| 29|         4| 20000|
|           Paul| 24|         3| 20000|
|         Harsha| 21|         1| 15000|
|        Shubham| 23|         2| 18000|
|Missing nih Bos| 34|        10| 38000|
|Missing nih Bos| 36|      null|  null|
+---------------+---+----------+------+

**Missing NA value kaya di bootcamp**

In [171]:
from pyspark.ml.feature import Imputer

imputer = Imputer(
            inputCols=['Age','Experience','Salary'],
            outputCols=["{}_imputed".format(c)for c in ['Age','Experience','Salary']]
).setStrategy("median")

In [169]:
df_spark

DataFrame[Name: string, Age: int, Experience: int, Salary: int]

In [172]:
imputer.fit(df_spark).transform(df_spark).show()

+---------+---+----------+------+-----------+------------------+--------------+
|     Name|Age|Experience|Salary|Age_imputed|Experience_imputed|Salary_imputed|
+---------+---+----------+------+-----------+------------------+--------------+
|    Krish| 31|        10| 30000|         31|                10|         30000|
|Sundhansh| 30|         8| 25000|         30|                 8|         25000|
|    Sunny| 29|         4| 20000|         29|                 4|         20000|
|     Paul| 24|         3| 20000|         24|                 3|         20000|
|   Harsha| 21|         1| 15000|         21|                 1|         15000|
|  Shubham| 23|         2| 18000|         23|                 2|         18000|
|     null| 34|        10| 38000|         34|                10|         38000|
|     null| 36|      null|  null|         36|                 4|         20000|
+---------+---+----------+------+-----------+------------------+--------------+